# 데이터 타입 - 그룻에는 어떤 데이터를 담을 수 있나? 

# 같은 그룻이라도 밥, 국을 담을 수 있다

# 데이터 타입 : 그룻에 담기는 데이터의 종류
# 파이썬에는 대표적으로 숫자, 문자, 논리형 데이터 타입이 있다. 
# 사용할 데이터 타입에 대한 이해는 매우 중요함

# 다른 사람들이 만든 패키지를 사용할 때 
# 해당 데이터의 데이터 타입에 맞도록 데이터를 가공하는 것이 매우 중요함

# 변수의 선언과 데이터 타입 확인
# 변수 = 데이터를 담는 그릇
# 변수에 담을 데이터를 결정하는 것 : 데이터 타입
# 데이터 타입을 알 수 있는 함수 : type()

a = 100
print(type(a))

b = 0.5
print(b)
print(type(b))

c1 = True
print(c1, type(c1))

c2 = 100 < 10
print(c2, type(c2))

d="MasoCampus"
print(d, type(d))

