# 현실 세계의 프로세스화
# 입력값 - Step1 - Step2 - Step3 - ... - 출력값

# 프로세스란 입력값과 출력값을 연결시켜주는 여러 활동들의 집합

# 외부 라이브러리 - 음식 할 때 쉽게 요리를 하기 위한 밀키트와 같은 개념

# 프로그램을 만든다는 것은 현실 세계의 일들을 잘게 조개서 정리하는 것 = 프로세스화
# 너무 복잡해지는 단계가 있다면 외부에 잘 만들어진 밀키트가 있는지를 확인 = 외부 라이브러리

# 파이썬 생태계 - 외부 라이브러리가 정말 풍부하게 존재함


# 현실 세계의 프로세스화 - 저녁식사 준비하기
# 입력값 - Step1 - Step2 - Step3 - ... - 출력값


# Step1. 냉장고에서 재료를 꺼내기

# Step2. 재료를 손질하기

# Step3. 재료를 조리하기

# Step4. 재료를 접시에 담기

# Step5. 접시를 테이블에 올리기

# Step6. 젓가락을 이용해 식사하기

# Step7. 식사를 마치고 접시를 씻기

# Step8. 냉장고에 재료를 넣기



